posts/na-xie-ti-gao-xiao-lu-de-alfred-workflow/index.org
#+BEGIN_COMMENT
.. title: 那些提高效率的Alfred Workflow
.. slug: na-xie-ti-gao-xiao-lu-de-alfred-workflow
.. date: 2018-09-21 10:02:49 UTC+08:00
.. tags: alfred
.. category: tools
.. link: 
.. description: 
.. type: text
#+END_COMMENT

* Alfred Browser Toolbox
  :PROPERTIES:
  :ID:       06FACFD5-9C4A-4549-8EED-7AEC3D77B480
  :END:
** 插件说明
   :PROPERTIES:
   :ID:       9C3F13F5-0F89-472D-89DA-AA1A6FDDBF82
   :END:
   Toolbox是一个文件操作浏览的工具，它支持创建、查找文件的功能，还可以查询pdf文件，非常方便。Mac上的Finder使用确定不方便。[[https://www.alfredforum.com/topic/5166-copymove-to-and-alfred-browser-workflows/][这里]]有具体的使用方式。
* Alfred Keywords Help
  :PROPERTIES:
  :ID:       49717B74-5702-483B-9E17-33D57893ED79
  :END:
** 插件说明
   :PROPERTIES:
   :ID:       AF2DD89D-740C-4622-94E3-444BED616409
   :END:
   安装的workflow多了，记忆触发的keyword就比较困难，使用[[https://github.com/pochemuto/alfred-help-workflow][Keywords help]]这个插件可以显示出所有已经安装的workflow的触发key，还可以根据workflow进行查询。
* Alfred Maestro
  :PROPERTIES:
  :ID:       784CA9EA-34BE-415E-B5F8-5122EE866885
  :END:
** 插件说明
   :PROPERTIES:
   :ID:       ED4A027F-CF88-4D09-ADDB-9630411A115F
   :END:
   操作Maestro的workflow，可以直接查找macro并执行。[[https://github.com/iansinnott/alfred-maestro][插件地址]]
* Alfred My Mind
  :PROPERTIES:
  :ID:       A7DE7E80-197F-45B4-9C21-71CBB239224F
  :END:
** 插件说明
   :PROPERTIES:
   :ID:       D2D98F0B-D8B3-4895-92F7-85CF3DC6451B
   :END:
   快速查询[[https://nikitavoloboev.xyz/][Nikita]]的githubpage内容的workflow，我在他的文章里面学到了很多。[[https://github.com/nikitavoloboev/alfred-my-mind#readme][插件地址]]
* Awesome lists
  :PROPERTIES:
  :ID:       35B0B749-2CE5-4E3B-BF74-E19299CEB25C
  :END:
** 插件说明
   :PROPERTIES:
   :ID:       3C1F7123-F5D6-4C14-AFFC-ADABC4D44518
   :END:
   快速查询Github上awesome列表的workflow，只为发现更多。[[https://github.com/nikitavoloboev/alfred-awesome-lists][插件地址]]，这个也是Nikita的作品。
* Baidu Map
  :PROPERTIES:
  :ID:       8927BBDF-C1D1-46D2-B787-BED1476D08AB
  :END:
** 插件说明
   :PROPERTIES:
   :ID:       2CA96F11-FCD7-4549-AD97-E862DA3E2A8D
   :END:
   在alfred上使用百度地图。[[https://github.com/wofeiwo/alfred-baidu-map][插件地址]]
* Birthday
  :PROPERTIES:
  :ID:       56143948-8358-4530-84DA-666BBA6B3F89
  :END:
** 插件说明
   :PROPERTIES:
   :ID:       97107D15-6E02-4C9F-928A-22700609D462
   :END:
   在alfred中显示你来到这个世界多长时间，让你珍惜每一分，每一秒。[[https://github.com/nikitavoloboev/small-workflows/tree/master/birthday#readme][插件地址]]
* Calendar
  :PROPERTIES:
  :ID:       0249D0F7-6AEC-4B4D-98DA-F5BBFA612BE6
  :END:
** 插件说明
   :PROPERTIES:
   :ID:       333C1CBD-BA88-4997-A928-183264866F48
   :END:
   在alfred中显示出当月的日历信息。[[https://github.com/owenwater/alfred-cal][插件地址]]
* Chromes Bookmarks
  :PROPERTIES:
  :ID:       BE3C62A7-8564-4B7B-97E1-464DC5ADD771
  :END:
** 插件说明
   :PROPERTIES:
   :ID:       C0B7984B-582F-4408-BDDF-7286F1EBDCCB
   :END:
   在aflred中搜索Chrome浏览器的书签，非常的好用。[[https://github.com/blainesch/alfred-chrome-bookmarks][插件地址]]
* Common Search
  :PROPERTIES:
  :ID:       7A5576D5-6ECD-496B-B29D-3AB3632F6D3A
  :END:
** 插件说明
   :PROPERTIES:
   :ID:       6C269BBB-091A-475E-AEF4-E9DF6F49EC6F
   :END:
   国内常用网站的搜索，现在支持知乎、淘宝、掘金、github。[[https://github.com/MuYunyun/commonSearch][插件地址]]
* Dash
  :PROPERTIES:
  :ID:       582CC0AD-7614-4FAA-8CD3-0DE84B380A50
  :END:
** 插件说明
   :PROPERTIES:
   :ID:       E31709A9-DD42-4A3D-A9D6-64F6A69BFBB8
   :END:
   在alfred中进行Dash的搜索，开发者必备。[[https://github.com/Kapeli/Dash-Alfred-Workflow][插件地址]]
* Directory watches
  :PROPERTIES:
  :ID:       A11F5899-DB1E-4A8A-A65D-201AAA4A85A5
  :END:
** 插件说明
   :PROPERTIES:
   :ID:       5E6FE591-83E1-46DF-93E8-464951AB7758
   :END:
   本地目录文件查看，指定目录的搜索，回收站文件显示。
* Emacs Workflow
  :PROPERTIES:
  :ID:       1D4EB2D4-0D51-442C-B754-0DD326A2A8DE
  :END:
** 插件说明
   :PROPERTIES:
   :ID:       B1F87FD7-832F-4642-B8B1-125AB098A3E8
   :END:
   在alfred中进行emacs的操作，比如打开文件等。[[https://www.alfredforum.com/topic/8444-emacs-workflow/][插件地址]]
* Eudic
  :PROPERTIES:
  :ID:       CEDC7309-2013-47E4-A24F-44F174E45288
  :END:
   :PROPERTIES:
# #   :ID:       B1092B02-FD5B-42A7-B8AB-54170950D275
#   :END:
** 插件说明
   :PROPERTIES:
   :ID:       BB1E1F7B-C8D8-4F95-93E4-97F03AB48241
   :END:
   使用欧路词典进行快速翻译。[[https://github.com/cdpath/eudic_tools][插件地址]]
* Git Repos
  :PROPERTIES:
  :ID:       024A5F17-021A-4080-9A19-922F35F7CA2C
  :END:
** 插件说明
   :PROPERTIES:
   :ID:       70B62A05-407D-438E-BA65-EDCA996CFFE8
   :END:
   搜索本地的git文件夹，搜索到后可以使用指定软件进行打开，开发时很有用。[[https://github.com/deanishe/alfred-repos][插件地址]]
* GitHub
  :PROPERTIES:
  :ID:       8A1D30CC-80E9-437C-A919-82903655213F
  :END:
** 插件说明
   :PROPERTIES:
   :ID:       23BB0C6B-8928-419E-8D7F-1ED5F8EFFFA5
   :END:
   搜索github上的项目，可以搜索项目，人物等。[[https://github.com/gharlan/alfred-github-workflow][插件地址]]
* Google Chrome History
  :PROPERTIES:
  :ID:       81A1FCE3-1AE3-4DD8-847C-2B48289BE260
  :END:
** 插件说明
   :PROPERTIES:
   :ID:       515DAD97-0847-4A22-9368-922FE169156F
   :END:
   在alfred中快速查看Chrome的浏览历史。[[https://github.com/tupton/alfred-chrome-history][插件地址]]
* Hammerspoon Workflow
  :PROPERTIES:
  :ID:       7BE62DC1-ADB6-4F06-B5F6-4C3C81882B08
  :END:
** 插件说明
   :PROPERTIES:
   :ID:       C21A733D-1A41-4D31-84A1-23B02A7BAFE6
   :END:
* Homebrew & Cask for Alfred
  :PROPERTIES:
  :ID:       8DC01423-3721-4D91-8F6D-8FC3C67115CC
  :END:
** 插件说明
   :PROPERTIES:
   :ID:       ED745051-07F4-4B4A-8357-70C79D73F2C1
   :END:
   在alfred中进行mac软件的更新、查看、安装等。[[https://github.com/fniephaus/alfred-homebrew/][插件地址]]
