posts/na-xie-ti-gao-xiao-lu-de-alfred-workflow/index.html
<!DOCTYPE html>
<html prefix="        og: http://ogp.me/ns# article: http://ogp.me/ns/article#     " vocab="http://ogp.me/ns" lang="zh_cn">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width">
<title>那些提高效率的Alfred Workflow | I'm company</title>
<link href="https://fonts.googleapis.com/css?family=Bitter:400,400i,700" rel="stylesheet" type="text/css">
<link rel="stylesheet" href="https://use.fontawesome.com/releases/v5.0.13/css/all.css" integrity="sha384-DNOHZ68U8hZfKXOrtjWvjxusGo9WQnrNx2sqG0tfsghAvtVlRW3tvkXWZh58N9jp" crossorigin="anonymous">
<link href="../../assets/css/all-nocdn.css" rel="stylesheet" type="text/css">
<meta name="theme-color" content="#5670d4">
<meta name="generator" content="Nikola (getnikola.com)">
<link rel="alternate" type="application/rss+xml" title="RSS" hreflang="zh_cn" href="../../rss.xml">
<link rel="canonical" href="http://blog.imcompany.cn/posts/na-xie-ti-gao-xiao-lu-de-alfred-workflow/">
<!--[if lt IE 9]><![endif]--><meta name="author" content="Tomyli">
<link rel="prev" href="../na-xie-ti-gao-xiao-lu-de-ideacha-jian/" title="那些提高效率的Idea插件" type="text/html">
<meta property="og:site_name" content="I'm company">
<meta property="og:title" content="那些提高效率的Alfred Workflow">
<meta property="og:url" content="http://blog.imcompany.cn/posts/na-xie-ti-gao-xiao-lu-de-alfred-workflow/">
<meta property="og:description" content="Alfred Browser Toolbox


Toolbox是一个文件操作浏览的工具，它支持创建、查找文件的功能，还可以查询pdf文件，非常方便。Mac上的Finder使用确定不方便。这里有具体的使用方式。




Alfred Keywords Help


安装的workflow多了，记忆触发的keyword就比较困难，使用Keywords help这个插件可以显示出所有已经安装的work">
<meta property="og:type" content="article">
<meta property="article:published_time" content="2018-09-21T10:02:49+08:00">
<meta property="article:tag" content="alfred">
</head>
<body>
    <a href="#page-content" class="sr-only sr-only-focusable">跳到主内容</a>
    <section class="social"><ul>
<li><a href="../../index.html" title="Home"><i class="fa fa-home"></i></a></li>
            <li><a href="../../archive.html" title="Archives"><i class="fa fa-folder-open"></i></a></li>
            <li><a href="../../categories/index.html" title="Tags"><i class="fa fa-tags"></i></a></li>
            <li><a href="../../rss.xml" title="RSS"><i class="fa fa-rss"></i></a></li>
            <li><a href="https://getnikola.com" title="About me"><i class="fa fa-user"></i></a></li>
            <li><a href="https://twitter.com/hougemeiga" title="My Twitter"><i class="fab fa-twitter"></i></a></li>
            <li><a href="https://github.com/peng051410" title="My Github"><i class="fab fa-github"></i></a></li>
    
    

        </ul></section><section class="page-content"><div class="content" rel="main">
            
<article class="post-text h-entry hentry postpage" itemscope="itemscope" itemtype="http://schema.org/Article"><header><h1 class="p-name entry-title" itemprop="headline name"><a href="." class="u-url">那些提高效率的Alfred Workflow</a></h1>

        <div class="metadata">
            <p class="dateline"><a href="." rel="bookmark"><i class="fa fa-clock"></i> <time class="published dt-published" datetime="2018-09-21T10:02:49+08:00" itemprop="datePublished" title="2018-09-21 10:02">2018-09-21 10:02</time></a></p>
            <p class="byline author vcard"> <i class="fa fa-user"></i> <span class="byline-name fn" itemprop="author">
                    Tomyli
            </span></p>
                <p class="commentline"><i class="far fa-comment"></i>
        
    <a href="#disqus_thread" data-disqus-identifier="cache/posts/na-xie-ti-gao-xiao-lu-de-alfred-workflow.html">Comments</a>


            
        </p>
<p class="sourceline"><a href="index.org" class="sourcelink"><i class="fa fa-file-code"></i> 资源</a></p>

            

            
    <div class="tags">
<h3 class="metadata-title">
<i class="fa fa-tags"></i> 标签:</h3>
        <ul itemprop="keywords" class="tags-ul">
<li><a class="tag p-category" href="../../categories/alfred/" rel="tag">alfred</a></li>
        </ul>
</div>

        </div>
    </header><div class="e-content entry-content" itemprop="articleBody text">
    <div id="outline-container-org77abc5f" class="outline-2">
<h2 id="org77abc5f">
<a id="ID-06FACFD5-9C4A-4549-8EED-7AEC3D77B480"></a>Alfred Browser Toolbox</h2>
<div class="outline-text-2" id="text-org77abc5f">
<p>
Toolbox是一个文件操作浏览的工具，它支持创建、查找文件的功能，还可以查询pdf文件，非常方便。Mac上的Finder使用确定不方便。<a href="https://www.alfredforum.com/topic/5166-copymove-to-and-alfred-browser-workflows/">这里</a>有具体的使用方式。
</p>
</div>
</div>
<div id="outline-container-org4e8996e" class="outline-2">
<h2 id="org4e8996e">
<a id="ID-49717B74-5702-483B-9E17-33D57893ED79"></a>Alfred Keywords Help</h2>
<div class="outline-text-2" id="text-org4e8996e">
<p>
安装的workflow多了，记忆触发的keyword就比较困难，使用<a href="https://github.com/pochemuto/alfred-help-workflow">Keywords help</a>这个插件可以显示出所有已经安装的workflow的触发key，还可以根据workflow进行查询。
</p>
</div>
</div>
<div id="outline-container-org5680902" class="outline-2">
<h2 id="org5680902">
<a id="ID-784CA9EA-34BE-415E-B5F8-5122EE866885"></a>Alfred Maestro</h2>
<div class="outline-text-2" id="text-org5680902">
<p>
操作Maestro的workflow，可以直接查找macro并执行。<a href="https://github.com/iansinnott/alfred-maestro">插件地址</a>
</p>
</div>
</div>
<div id="outline-container-orgae3f69f" class="outline-2">
<h2 id="orgae3f69f">
<a id="ID-A7DE7E80-197F-45B4-9C21-71CBB239224F"></a>Alfred My Mind</h2>
<div class="outline-text-2" id="text-orgae3f69f">
<p>
快速查询<a href="https://nikitavoloboev.xyz/">Nikita</a>的githubpage内容的workflow，我在他的文章里面学到了很多。<a href="https://github.com/nikitavoloboev/alfred-my-mind#readme">插件地址</a>
</p>
</div>
</div>
<div id="outline-container-org5a0d01b" class="outline-2">
<h2 id="org5a0d01b">
<a id="ID-35B0B749-2CE5-4E3B-BF74-E19299CEB25C"></a>Awesome lists</h2>
<div class="outline-text-2" id="text-org5a0d01b">
<p>
快速查询Github上awesome列表的workflow，只为发现更多。<a href="https://github.com/nikitavoloboev/alfred-awesome-lists">插件地址</a>，这个也是Nikita的作品。
</p>
</div>
</div>
<div id="outline-container-orgda961d0" class="outline-2">
<h2 id="orgda961d0">
<a id="ID-8927BBDF-C1D1-46D2-B787-BED1476D08AB"></a>Baidu Map</h2>
<div class="outline-text-2" id="text-orgda961d0">
<p>
在alfred上使用百度地图。<a href="https://github.com/wofeiwo/alfred-baidu-map">插件地址</a>
</p>
</div>
</div>
<div id="outline-container-orgad7a293" class="outline-2">
<h2 id="orgad7a293">
<a id="ID-56143948-8358-4530-84DA-666BBA6B3F89"></a>Birthday</h2>
<div class="outline-text-2" id="text-orgad7a293">
<p>
在alfred中显示你来到这个世界多长时间，让你珍惜每一分，每一秒。<a href="https://github.com/nikitavoloboev/small-workflows/tree/master/birthday#readme">插件地址</a>
</p>
</div>
</div>
<div id="outline-container-org39af3fe" class="outline-2">
<h2 id="org39af3fe">
<a id="ID-0249D0F7-6AEC-4B4D-98DA-F5BBFA612BE6"></a>Calendar</h2>
<div class="outline-text-2" id="text-org39af3fe">
<p>
在alfred中显示出当月的日历信息。<a href="https://github.com/owenwater/alfred-cal">插件地址</a>
</p>
</div>
</div>
<div id="outline-container-org1de0bdd" class="outline-2">
<h2 id="org1de0bdd">
<a id="ID-BE3C62A7-8564-4B7B-97E1-464DC5ADD771"></a>Chromes Bookmarks</h2>
<div class="outline-text-2" id="text-org1de0bdd">
<p>
在aflred中搜索Chrome浏览器的书签，非常的好用。<a href="https://github.com/blainesch/alfred-chrome-bookmarks">插件地址</a>
</p>
</div>
</div>
<div id="outline-container-orgcaaf5bc" class="outline-2">
<h2 id="orgcaaf5bc">
<a id="ID-7A5576D5-6ECD-496B-B29D-3AB3632F6D3A"></a>Common Search</h2>
<div class="outline-text-2" id="text-orgcaaf5bc">
<p>
国内常用网站的搜索，现在支持知乎、淘宝、掘金、github。<a href="https://github.com/MuYunyun/commonSearch">插件地址</a>
</p>
</div>
</div>
<div id="outline-container-orgcc39631" class="outline-2">
<h2 id="orgcc39631">
<a id="ID-582CC0AD-7614-4FAA-8CD3-0DE84B380A50"></a>Dash</h2>
<div class="outline-text-2" id="text-orgcc39631">
<p>
在alfred中进行Dash的搜索，开发者必备。<a href="https://github.com/Kapeli/Dash-Alfred-Workflow">插件地址</a>
</p>
</div>
</div>
<div id="outline-container-org4d89c35" class="outline-2">
<h2 id="org4d89c35">
<a id="ID-A11F5899-DB1E-4A8A-A65D-201AAA4A85A5"></a>Directory watches</h2>
<div class="outline-text-2" id="text-org4d89c35">
<p>
本地目录文件查看，指定目录的搜索，回收站文件显示。
</p>
</div>
</div>
<div id="outline-container-org60692aa" class="outline-2">
<h2 id="org60692aa">
<a id="ID-1D4EB2D4-0D51-442C-B754-0DD326A2A8DE"></a>Emacs Workflow</h2>
<div class="outline-text-2" id="text-org60692aa">
<p>
在alfred中进行emacs的操作，比如打开文件等。<a href="https://www.alfredforum.com/topic/8444-emacs-workflow/">插件地址</a>
</p>
</div>
</div>
<div id="outline-container-orgda3764d" class="outline-2">
<h2 id="orgda3764d">
<a id="ID-CEDC7309-2013-47E4-A24F-44F174E45288"></a>Eudic</h2>
<div class="outline-text-2" id="text-orgda3764d">
</div>
<div id="outline-container-orgeab25e1" class="outline-3">
<h3 id="orgeab25e1">
<a id="ID-BB1E1F7B-C8D8-4F95-93E4-97F03AB48241"></a>插件说明</h3>
<div class="outline-text-3" id="text-orgeab25e1">
<p>
使用欧路词典进行快速翻译。<a href="https://github.com/cdpath/eudic_tools">插件地址</a>
</p>
</div>
</div>
</div>
<div id="outline-container-org477fd62" class="outline-2">
<h2 id="org477fd62">
<a id="ID-024A5F17-021A-4080-9A19-922F35F7CA2C"></a>Git Repos</h2>
<div class="outline-text-2" id="text-org477fd62">
</div>
<div id="outline-container-org558cc60" class="outline-3">
<h3 id="org558cc60">
<a id="ID-70B62A05-407D-438E-BA65-EDCA996CFFE8"></a>插件说明</h3>
<div class="outline-text-3" id="text-org558cc60">
<p>
搜索本地的git文件夹，搜索到后可以使用指定软件进行打开，开发时很有用。<a href="https://github.com/deanishe/alfred-repos">插件地址</a>
</p>
</div>
</div>
<div id="outline-container-org5fe9cb2" class="outline-3">
<h3 id="org5fe9cb2">
<a id="ID-23BB0C6B-8928-419E-8D7F-1ED5F8EFFFA5"></a>插件说明</h3>
<div class="outline-text-3" id="text-org5fe9cb2">
<p>
搜索github上的项目，可以搜索项目，人物等。<a href="https://github.com/gharlan/alfred-github-workflow">插件地址</a>
</p>
</div>
</div>
</div>
<div id="outline-container-orga3a4f0b" class="outline-2">
<h2 id="orga3a4f0b">
<a id="ID-81A1FCE3-1AE3-4DD8-847C-2B48289BE260"></a>Google Chrome History</h2>
<div class="outline-text-2" id="text-orga3a4f0b">
<p>
在alfred中快速查看Chrome的浏览历史。<a href="https://github.com/tupton/alfred-chrome-history">插件地址</a>
</p>
</div>
</div>
<div id="outline-container-org226735c" class="outline-2">
<h2 id="org226735c">
<a id="ID-7BE62DC1-ADB6-4F06-B5F6-4C3C81882B08"></a>Hammerspoon Workflow</h2>
<div class="outline-text-2" id="text-org226735c">
</div>
</div>
<div id="outline-container-orgd8dcdc4" class="outline-2">
<h2 id="orgd8dcdc4">
<a id="ID-8DC01423-3721-4D91-8F6D-8FC3C67115CC"></a>Homebrew &amp; Cask for Alfred</h2>
<div class="outline-text-2" id="text-orgd8dcdc4">
<p>
在alfred中进行mac软件的更新、查看、安装等。<a href="https://github.com/fniephaus/alfred-homebrew/">插件地址</a>
</p>
</div>
</div>
