posts/na-xie-ti-gao-xiao-lu-de-alfred-workflow/index.html
<div id="outline-container-org31f94f2" class="outline-2">
<h2 id="org31f94f2">
<a id="ID-10218152-446D-42E4-8D4E-CF3E7BA598F1"></a>iTerm Sessions</h2>
<div class="outline-text-2" id="text-org31f94f2">
<p>
在alfre中快速切换iterm中存在的session窗口。<a href="https://github.com/madvas/alfred-iterm-sessions">插件地址</a>
</p>
</div>
</div>
<div id="outline-container-org5cb1f7b" class="outline-2">
<h2 id="org5cb1f7b">
<a id="ID-3426706F-953B-4464-869B-BFEB68EFBBA9"></a>Kill Process</h2>
<div class="outline-text-2" id="text-org5cb1f7b">
<p>
在alfred中kill进程，有时候程序假死，使用这个很方便，不用再在苹果的菜单栏中点击好几下来操作了。<a href="https://github.com/nathangreenstein/alfred-process-killer">插件地址</a>
</p>
</div>
</div>
<div id="outline-container-org2900220" class="outline-2">
<h2 id="org2900220">
<a id="ID-FE3BF159-26CC-4D02-95DC-E8AC3393B8C7"></a>Last changed files</h2>
<div class="outline-text-2" id="text-org2900220">
<p>
显示出当前系统最新修改的文件，对于系统有什么修改一目了然。
</p>
</div>
</div>
<div id="outline-container-org74157fc" class="outline-2">
<h2 id="org74157fc">
<a id="ID-F7872C53-3F87-4A9E-A90D-E2701D343046"></a>Launcher</h2>
<div class="outline-text-2" id="text-org74157fc">
<p>
应用程序快速启动workflow，结束Karabiner使用。
</p>
</div>
</div>
<div id="outline-container-orga3b91e5" class="outline-2">
<h2 id="orga3b91e5">
<a id="ID-433CC6A2-1555-4C17-98AD-27353548F7C0"></a>Learn Anything</h2>
<div class="outline-text-2" id="text-orga3b91e5">
<p>
Nivita的Learn Anything，只为学习更多。<a href="https://github.com/nikitavoloboev/alfred-learn-anything">插件地址</a>
</p>
</div>
</div>
<div id="outline-container-org018ebdf" class="outline-2">
<h2 id="org018ebdf">
<a id="ID-60006CDE-E02A-4828-92E8-2ECDED8268CB"></a>Linux Command</h2>
<div class="outline-text-2" id="text-org018ebdf">
<p>
Linux命令手册，快速查询linux命令。<a href="https://github.com/jaywcjlove/linux-command">插件地址</a>
</p>
</div>
</div>
<div id="outline-container-org45cb228" class="outline-2">
<h2 id="org45cb228">
<a id="ID-929CF82B-8B2C-4C05-8E14-6EC004B29319"></a>Mail.app Search</h2>
<div class="outline-text-2" id="text-org45cb228">
<p>
快速搜索Mail.app中的邮件信息。可以根据邮件名，发送人，主题等进行搜索。<a href="http://www.packal.org/workflow/mailapp-search">插件地址</a>
</p>
</div>
</div>
<div id="outline-container-orged09c4e" class="outline-2">
<h2 id="orged09c4e">
<a id="ID-C0D62E25-FF33-49C1-82B0-1AD25978BA52"></a>MyIP</h2>
<div class="outline-text-2" id="text-orged09c4e">
<p>
快速的查询本机的ip，包括本地IP与外网IP。
</p>
</div>
</div>
<div id="outline-container-org31138d5" class="outline-2">
<h2 id="org31138d5">
<a id="ID-DA90B235-A56A-4360-94E9-00C1647DC319"></a>NSC</h2>
<div class="outline-text-2" id="text-org31138d5">
<p>
各种进制的转换，支持二进制、十进制、十六进制之间的快速转换。<a href="https://github.com/obstschale/NSC">插件地址</a>
</p>
</div>
</div>
<div id="outline-container-org1980c9d" class="outline-2">
<h2 id="org1980c9d">
<a id="ID-9209A35D-3D61-45A9-B8BD-25538F35B8E2"></a>org-mode-capture</h2>
<div class="outline-text-2" id="text-org1980c9d">
<p>
快速插入Org capture，可以快速的记录TODO事件。<a href="https://github.com/alexandergogl/alfred-org-mode-workflow">插件地址</a>
</p>
</div>
</div>
<div id="outline-container-org1f96bdb" class="outline-2">
<h2 id="org1f96bdb">
<a id="ID-9E445427-E5CD-449B-BA91-61DFBEF26466"></a>Packal Search</h2>
<div class="outline-text-2" id="text-org1f96bdb">
<p>
Alfred workflow的快速搜索、更新。<a href="https://github.com/deanishe/alfred-packal-search">插件地址</a>
</p>
</div>
</div>
<div id="outline-container-orgc44d8a0" class="outline-2">
<h2 id="orgc44d8a0">
<a id="ID-36ECE447-1661-4B7A-93A3-2DA900A803D8"></a>Recent Documents / Apps</h2>
<div class="outline-text-2" id="text-orgc44d8a0">
<p>
显示当前的文档信息，当前的app信息，当前app关联的文档信息。<a href="https://github.com/mpco/Alfred3-workflow-recent-documents">插件地址</a>
</p>
</div>
</div>
<div id="outline-container-org2b09659" class="outline-2">
<h2 id="org2b09659">
<a id="ID-A41488FA-B6F7-4ED7-B749-C221D0DEFA77"></a>Search Safari and Chrome Tabs</h2>
<div class="outline-text-2" id="text-org2b09659">
<p>
搜索Chrome和Safari当前打开的tab页面，支持跳转到选择页面。<a href="http://www.packal.org/workflow/search-safari-and-chrome-tabs">插件地址</a>
</p>
</div>
</div>
<div id="outline-container-orgce7debd" class="outline-2">
<h2 id="orgce7debd">
<a id="ID-496F6122-8863-4020-8C14-1E0DACC18462"></a>Searchio!</h2>
<div class="outline-text-2" id="text-orgce7debd">
<p>
支持google、youtuebe、wiki的fuzzy搜索，支持配置多种语言。<a href="https://github.com/deanishe/alfred-searchio">插件地址</a>
</p>
</div>
</div>
<div id="outline-container-org5709688" class="outline-2">
<h2 id="org5709688">
<a id="ID-9A0BF988-2311-47D8-8CC6-48DCA22BD735"></a>SSH SecureCRT</h2>
<div class="outline-text-2" id="text-org5709688">
<p>
在alfre快速连接SecureCRT的session。
</p>
</div>
</div>
<div id="outline-container-org00484a7" class="outline-2">
<h2 id="org00484a7">
<a id="ID-B50A0847-AACE-48BB-BB84-1B728A8FD3D8"></a>StackOverflow</h2>
<div class="outline-text-2" id="text-org00484a7">
<p>
搜索stackoverflow上的指定问题。<a href="https://github.com/deanishe/alfred-stackoverflow">插件地址(deanishe)</a> 
</p>
</div>
</div>
<div id="outline-container-org78bd1de" class="outline-2">
<h2 id="org78bd1de">
<a id="ID-8F1A51E6-77C2-488A-875E-D4933DF92B11"></a>Swift Window Switcher</h2>
<div class="outline-text-2" id="text-org78bd1de">
<p>
使用alfred来快速切换应用的窗口，还可以对safari的当前标签进行搜索。<a href="https://github.com/mandrigin/AlfredSwitchWindows">插件地址</a>
</p>
</div>
</div>
<div id="outline-container-orgb412710" class="outline-2">
<h2 id="orgb412710">
<a id="ID-5F9D7E27-626F-4AA4-9BD5-F6D6699F7E3D"></a>SwitchHosts!</h2>
<div class="outline-text-2" id="text-orgb412710">
<p>
在alfred中快速本地host的配置，配合<a href="https://github.com/oldj/SwitchHosts">SwitchHosts</a>来使用。<a href="http://www.packal.org/workflow/switchhosts">插件地址</a>
</p>
</div>
</div>
<div id="outline-container-orgdfca52d" class="outline-2">
<h2 id="orgdfca52d">
<a id="ID-1DDA64C3-16EA-4CAC-93F7-9F94F3CD7DE8"></a>Tldr</h2>
<div class="outline-text-2" id="text-orgdfca52d">
<p>
Tldr的alfred版本，快速查询命令。<a href="https://github.com/cs1707/tldr-alfred">插件地址</a>
</p>
</div>
</div>
<div id="outline-container-org503d88a" class="outline-2">
<h2 id="org503d88a">
<a id="ID-24331980-1F67-4F56-B2BC-611B5AD361AD"></a>Uninstall with CleanMyMac X</h2>
<div class="outline-text-2" id="text-org503d88a">
<p>
使用CleanMyMac来快速卸载软件。<a href="http://www.packal.org/workflow/uninstall-cleanmymac-x">插件地址</a>
</p>
</div>
</div>
<div id="outline-container-org300ef98" class="outline-2">
<h2 id="org300ef98">
<a id="ID-4717273F-3FD0-41E2-8129-B54E49F59613"></a>VagrantUP</h2>
<div class="outline-text-2" id="text-org300ef98">
<p>
控制vagrant的workflow，可以显示vagrant的环境，根据name，path进行过滤等。<a href="https://github.com/m1keil/alfred-vagrant-workflow">插件地址</a>
</p>
</div>
</div>
<div id="outline-container-org21139a6" class="outline-2">
<h2 id="org21139a6">
<a id="ID-E0A0B020-F936-44C5-B060-44FEE22DE9F5"></a>VMWare Control</h2>
<div class="outline-text-2" id="text-org21139a6">
<p>
在alfred中控制vmware虚拟机。支持启动、停止、挂起、切换等操作。<a href="http://www.packal.org/workflow/vmware-control">插件地址</a>
</p>
</div>
</div>
<div id="outline-container-orgb589486" class="outline-2">
<h2 id="orgb589486">
<a id="ID-23FA43C2-A45D-491D-9EC6-CF7E3A719F4F"></a>Web Searches</h2>
<div class="outline-text-2" id="text-orgb589486">
<p>
通用的web搜索，支持reddit，google translate等网站搜索。<a href="https://github.com/nikitavoloboev/alfred-web-searches">插件地址</a>
</p>
</div>
</div>
<div id="outline-container-org42ee512" class="outline-2">
<h2 id="org42ee512">
<a id="ID-22EA63EA-EBCA-49D8-9880-41B39AC40AB6"></a>WeChat Plugin</h2>
<div class="outline-text-2" id="text-org42ee512">
<p>
在alfred中进行微信聊天，可以显示聊天记录，超级方便。<a href="https://github.com/TKkk-iOSer/WeChatPlugin-MacOS">插件地址</a>
</p>
</div>
</div>
<div id="outline-container-orgd1b235f" class="outline-2">
<h2 id="orgd1b235f">
<a id="ID-72D51B8A-7C70-4E0D-9F7E-359464014DA2"></a>Wi-Fi</h2>
<div class="outline-text-2" id="text-orgd1b235f">
<p>
控制Mac的ip开关，新更新的版本增加了重启wifi的功能。<a href="https://github.com/ravelll/wifi-workflow">插件地址</a>
</p>
</div>
</div>
<div id="outline-container-orgfa45815" class="outline-2">
<h2 id="orgfa45815">
<a id="ID-95EFB24B-5451-46BD-B668-7F76501EA079"></a>Youdao Translate</h2>
<div class="outline-text-2" id="text-orgfa45815">
<p>
有道词典快速查询翻译，支持中英互译，发音，记录查询历史等功能。<a href="https://github.com/Rouwanzi/AlfredWorkflow_YoudaoTranslate">插件地址</a>
</p>
</div>
</div>
<div id="outline-container-org4839629" class="outline-2">
<h2 id="org4839629">
<a id="ID-B66C2574-28E1-4B82-90D2-0BAAC9879BCD"></a>Zapier for Alfred</h2>
<div class="outline-text-2" id="text-org4839629">
<p>
